<template>
  <div id="introduction">
    <div class="i-block">
      <div class="i-title">课程简介</div>
      <div class="i-content">
        《数字信号处理》是现代信息处理和传输的基础课程之一，已经成为通信工程、信息工程、电子信息工程、自动化、电子科学与技术等专业的必修课。本课程以离散时间信号与系统作为对象，在介绍经典理论的基础上，适当引入现代信号处理的理论与方法。通过本课程的学习，学生能够掌握确定性离散时间信号的频谱分析原理及快速实现方法，数字滤波器的设计及实现方法。能够利用计算机技术来进行数字信号的处理，并根据实际需要分析、设计数字滤波系统。本课程是进一步学习数字通信、图像处理、随机数字信号处理、无线通信、多媒体通信等专业课程的先修课程。
      </div>
    </div>

    <div class="i-block">
      <div class="i-title">课程目标</div>
      <div class="i-content">
        北邮是我国信息通信科技人才的重要培养基地。本课程是电子信息类的专业基础课，授课对象为大二本科生。学生的学习风气、前期基础比较好。作为核心专业基础课，紧密贴合“培养具有创新创业意识和终身学习能力的信息通信领域高级专业技术人才或领军型人才”的人才培养宗旨，充分重视学生综合分析与创新能力培养，以学生发展为中心、以产出为导向。通过课程学习，能使学生（1）在数字信号处理专业知识方面，打牢基础，为后续进一步学习信息通信相关的专业课程，从事信息通信领域的理论研究和工程技术工作奠定基础；（2）在工程能力方面，培养学生的创新思考能力、分析问题解决问题的能力；（3）在综合素质方面，做到知识传授与价值引领有机统一，帮助学生树立辩证唯物主义的自然观、科学技术方法论和科技工程观。 </div>
    </div>

    <div class="i-block">
      <div class="i-title">课程建设发展历程</div>
      <div class="i-content">
        《数字信号处理》课程是在上世纪80年代由全子一教授开设，1988年出版了教材，2002年和2009年分别更新出版了新的教材，这门课历史悠久，不断传承。十一五、十二五期间持续改进，十三五期间出版了英文教材，并完成了《数字信号处理》英文课程的建设，为“一带一路”人才培养做出了贡献。近年完成授课视频录制，采用新模式、新媒体传授知识，同时持续推进课程思政建设，注重价值引领。 </div>
      <div class="i-img">
        <img width="800" src="../assets/kcfzlc.png" alt="课程建设发展历程">
      </div>

    </div>

    <div class="i-block">
      <div class="i-title">课程特色</div>
      <div class="i-content">
        经过长期建设，北邮的《数字信号处理》课程已经形成了鲜明的特色。以“育才”为核心，进行了 “三合一体化”教学模式创新，探索了专业知识与思政知识的有机融合，帮助学生掌握科学思维方法。发挥教学团队的科研优势，坚持“强化基础理论、突出实践应用、面向学科交叉、鼓励创新探索”的人才培养理念。吸引本科生参与创新创业及科研活动、科技竞赛，真正落实“科教融合”。线上与线下协同教学，积极响应5G+AI的时代特征，面向产业需求深化数字信号处理教学内容改革，加强学生知识掌握的全面性与深入性。 </div>
      <div class="i-img">
        <img width="800" src="../assets/kcts.png" alt="课程特色">
      </div>
    </div>

  </div>
</template>

<script>
export default {
  name: 'Introduction',
  data(){
      return {
          
      }
  }
}
</script>


<style lang="less" scoped>
.i-block {
  margin-bottom: 15px;
}
.i-title {
  font-size: 25px;
  font-weight: bold;
  margin-bottom: 10px;
}
.i-content {
  font-size: 16px;
  margin-bottom: 10px;
}
.i-img {
  width: 100%;
  display: flex;
  justify-content: center;
}
</style>
