<template>
  <div id="teacher">
    <div>
      <div class="i-title">{{teacherInfo.name}}</div>
      <div class="t-content">
        <img width="200" :src="'DSP_picture/teachers/' + teacherInfo.pic" :alt="teacherInfo.name">
        <p>{{teacherInfo.introduction}}</p>
      </div>
    </div>

  </div>
</template>

<script>
export default {
  name: 'teacher',
  data(){
      return {
          teacherInfoList: [
              {
                  name: "苏菲",
                  introduction: "苏菲，北京邮电大学教授，博士生导师。自2002年开始主讲《数字信号处理》课程，自2008年起任该课程负责人。成功申请并负责建设第二批来华留学生品牌课《Fundamentals of Multimedia Technology》，主讲的《多媒体计算机应用基础》获批教育部双语教学示范课程建设项目。合编国家级规划教材《数字信号处理》，在多所高校得到了推广使用。积极推动实施科教深度融合，吸引优秀本科生参与科研实践，指导的本科生获得第四届中国国际“互联网+”大学生创新创业大赛铜奖、第六届中国国际“互联网+”大学生创新创业大赛（北京赛区）一等奖、二等奖各1项。获得第四届、第六届“互联网+”大学生创新创业大赛优秀指导教师奖（北京赛区），完成了多项教育部、北京市的教育教学改革项目。",
                  pic: "/苏菲/苏菲.jpg"
              },
              {
                  name: "杜海清",
                  introduction: "杜海清，讲师。2010年毕业于北京邮电大学，获得通信与信息系统专业工学博士学位，2013年美国华盛顿大学电子工程系访问学者，现在北京邮电大学信息与通信工程学院通信网技术教研中心任教。研究方向为无线视频传输及视频质量评价，近5年主持、参加相关科研课题7项，获得国家发明专利7项，发表相关论文10余篇。",
                  pic: "/杜海清/杜海清.jpg"
              },
              {
                  name: "郭彩丽",
                  introduction: "郭彩丽，教授，博士生导师。2008年毕业于北京邮电大学，获通信与信息系统专业博士学位，现在北京邮电大学信息与通信工程学院从事教学与科研工作。现任IEEE 高级会员（Senior Member），中国高科技产业化研究会信号与信息处理专家委员会委员。主要研究方向为无线移动通信技术、认知无线电、信号检测与估值、车联网、可见光通信、社交跨媒体数据挖掘与分析等。近几年在相关研究领域承担和完成了多项国家自然科学基金，国家863计划，国家重大专项等多项国家级、省部级及企业合作项目。2013年入选“北京市青年英才计划”。",
                  pic: "/郭彩丽/郭彩丽.jpg"
              },
              {
                  name: "郭莉",
                  introduction: "郭莉，教授，博士生导师，北京邮电大学国际学院院长。主持和参加了国家自然基金面上项目、国家重点基础研究发展计划（973）项目，国家高技术研究发展计划（863）项目，国家自然科学基金专项基金资助项目、国家科技支撑计划（攻关计划）项目、国家科技重大专项项目、政府间国际合作交流项目、北京市科委项目、企、事业单位横向委托项目等。获得过北京市优秀教师、北京市高校优秀青年骨干教师、北京市高校优秀教学成果一等奖、北京市高校优秀教学成果二等奖、 国家级教学成果二等奖。",
                  pic: "/郭莉/郭莉.jpg"
              },
              {
                  name: "李江军",
                  introduction: "李江军，讲师。主要从事语音及音频信号处理、多媒体通信等领域的科研和教学工作。研究方向为多媒体信息处理与通信，互联网应用等。",
                  pic: "/李江军/李江军.jpg"
              },
              {
                  name: "刘芳芳",
                  introduction: "刘芳芳，博士，硕士生导师。近5年承担“数字信号处理”理论及实验教学累计10轮次，共计24学分/400学时，包括留学生在内学生人数达569人，涵盖通信工程、电子科学与技术、应用物理学、测控仪器与技术等专业，教学效果良好。积极开展课程思政建设，以自然辩证法哲学思想为指导进行课程思政体系化建设方法研究，共同主持完成校级“高新”课程建设项目1项，主持校级课程思政教改项目“数字信号处理课程思政体系化建设研究与实践”1项。",
                  pic: "/刘芳芳/刘芳芳.jpg"
              },
              {
                  name: "门爱东",
                  introduction: "门爱东，教授，博士生导师。2018年获得北京市教学名师，2020年荣获北京邮电大学第二届“烛光奖”。2020年之前担任学校电子信息工程专业负责人，负责“电子信息工程”北京市高校特色专业建设。该专业2010年成为全国首批通过工程教育专业认证的电子信息工程专业，2019年通过了第二次认证。\n担任本科“多媒体通信”课程群负责人，包括《多媒体系统建模与仿真》和《数字音视频原理》等11门课程，负责群课程的建设方向及内容规划，修订教学大纲，开展青年教师培训和教学研讨，对教学过程中出现的问题提出建议。\n从1995年开始一直主讲本科生“数字信号处理”课程，2010年以前担任课程负责人，该课程是我校核心专业基础课，结合教育部、北京市和学校教改项目、精品课程和实验教学示范中心建设等，在教学组织、内容、方法、实验、课程衔接等进行了全方位的优化。\n编写了“十一五“国家级规划教材《数字信号处理》，得到了国内许多高校的选用。",
                  pic: "/门爱东/门爱东.jpg"
              },
              {
                  name: "孙松林",
                  introduction: "孙松林，教授，博士生导师，现任北京邮电大学信息与通信工程学院多媒体教研中心主任，IEEE高级会员、中国计算机学会CCF高级会员、ACM会员。2003年于北京邮电大学获得工学博士学位。研究方向为智能信号处理、视频编码与通信，在移动互联网安全技术国家工程实验室、可信分布式计算与服务教育部重点实验室从事科研工作。",
                  pic: "/孙松林/孙松林.jpg"
              },
              {
                  name: "田磊",
                  introduction: "田磊，讲师，北京邮电大学通信与信息系统专业博士毕业。自2009年，从事无线移动通信信道测量与建模研究，包括无线宽带系统信道测量方法、多天线（MIMO）系统信道测量方法、信道特性参数提取算法，信道的大尺度衰落和小尺度衰落特性的建模，以及移动通信信道模型的建模。目前，主要研究面向5G移动通信系统的高频段和MassiveMIMO信道测量与建模。",
                  pic: "/田磊/田磊.jpg"
              },
              {
                  name: "王海婴",
                  introduction: "王海婴，女，副教授，硕士生导师。1982年入学北京邮电大学无线电工程系，先后获得学士、硕士、博士学位。1989年留校任教至今。多年来一直从事音视频处理与通信相关的教学与研究工作，主讲过的课程有：电视原理、C语言程序设计、多媒体计算机应用基础、现代通信技术、视频信号处理、数字信号处理等。主持及参加完成过多项国家、省部级、军队及企事业科研项目，在重要学术刊物及会议上发表论文20余篇，参编国家十一五教材一部，申请专利2项，获校教改项目一等奖一项，参加市精品课程建设2门。主要研究内容包括视音频信号处理、多媒体通信、数字信号处理等。",
                  pic: "/王海婴/王海婴.jpg"
              },
              {
                  name: "王雷",
                  introduction: "王雷，教授，博士生导师。1993年毕业于清华大学，获工学学士学位；1997年毕业于北京邮电大学，获工学博士学位。中国通信学会高级会员，中国图象图形学会高级会员，中国电子学会高级会员，中国电子学会消费电子分会委员，AVS工作组系统专题组联合组长。研究领域包括多媒体通信技术、IP网络的QoS技术、音视频压缩编码技术以及网络安全技术等。",
                  pic: "/王雷/王雷.jpg"
              },
              {
                  name: "王生楚",
                  introduction: "王生楚，副教授、硕士生导师，博士毕业于清华大学电子工程系。本人长期从事无线信号处理研究，致力于基于现代人工智能和贝叶斯推断技术解决现代信号处理难题，包括电磁大数据智能挖掘、面向下一代无线通信的低耗高速物理层链路技术、物联网动态场景高精度定位等。相关研究获得国家自然科学基金青年项目、GF科研基金、企事业横向课题等十余项目支持，相关研究成果已经在中科院1/2区、领域国际顶级期刊（如IEEE Transactions on Wireless Communications, IEEE Transactions on Transportation Systems、IEEE Transactions on Communications）发表第一/通信作者署名论文十余篇，并申请国家发明专利8件（授权4件）。在学生指导方面，曾指导两名硕士研究生获得国家奖学金，指导本科生获得大学生创新创业大赛二、三等奖，指导研究生参加创新创业大赛获得二等奖。",
                  pic: "/王生楚/王生楚.jpg"
              },
              {
                  name: "张建华",
                  introduction: "张建华，2003年获北京邮电大学博士学位，北京邮电大学岗位特聘教授，有博士生招生权。2002年选送到德国汉堡-哈堡科技大学深造半年，2008年受国家留学基金委支持前往韩国访问半年。IEEE Signal Processing Letter,IEEE Transaction on WirelessCom, IEEE Transaction on Comm. Letter 等多种杂志和期刊的审稿人，创办了International Workshop on Channel Measurement and Modeling (IWonCMM)会议。主要从事情宽带移动通信新技术和多天线信道测量、建模研究，在理论研究和标准化方面取得了多项显著成果。目前承担国家重大专项、863重点项目和国家自然科学基金课题，截至2010年4月，在国际会议和期刊已发表90余篇文章，其中SCI检索15篇（发表在JCN杂志的文章获得2008唯一最佳论文奖），申请专利20余项，授权4项；2005年获北京市“科技新星”称号，作为第六完成人2006年获中国通信学会科学技术一等奖一次，第五完成人2008年获国家技术发明奖二等奖一次，第二完成人2009年获中国通信标准化协会科学技术二等奖一次。",
                  pic: "/张建华/张建华.jpg"
              },
              {
                  name: "赵志诚",
                  introduction: "赵志诚，北京邮电大学副教授，博士生导师。自2009年开始主讲《数字信号处理》课程，教学效果好。指导学生获得第六届中国国际“互联网+”大学生创新创业大赛（北京赛区）一等奖2项。主持和参与国家重大研究计划、国家863计划、国家科技支撑计划、国家自然科学基金重点及面上项目等，在国内外重要学术刊物及会议上发表学术论文80余篇、申请专利十余项，指导学生在国际和国内多个人工智能相关竞赛中获得冠军。",
                  pic: "/赵志诚/赵志诚.jpg"
              },
              {
                  name: "邹卫霞",
                  introduction: "邹卫霞，副教授，博士生导师。1994年毕业于同济大学电气工程系，2002年获得山东大学电子工程系硕士学位，2006年获得北京邮电大学工学博士学位。主要从事的研究方向有短距离无线通信新技术、毫米波通信技术及电磁兼容等工作，国内外期刊和会议上发表论文80多篇，其中EI检索60多篇，SCI检索二十多篇，申请专利14项。",
                  pic: "/邹卫霞/邹卫霞.jpg"
              },

          ],
          teacherInfo: {},
      }
  },
  mounted: function (){
      let name = this.$route.params.name
      let index = this.teacherInfoList.findIndex(item => item.name === name);
      this.teacherInfo = this.teacherInfoList[index]
  }
}
</script>


<style lang="less" scoped>
#teacher {
  display: flex;
  justify-content: center;
}
.i-title {
  font-size: 25px;
  font-weight: bold;
  margin-bottom: 10px;
}
.t-content {
  display: flex;
  p {
    margin-left: 50px;
    text-indent: 2em;
    width: 800px;
    line-height: 30px;
  }
}
</style>
